---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
source: html/62345498-a884-bfff-d108-ad735416cc11.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW

Defines parameters for Angle structural section.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralW : StructuralSectionHotRolled
```